## DNS
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
cds-snc.ca.tf
```
```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                          NAME                           |
|--------|---------------------------------------------------------|
| add    | `aws_route53_record.mailchimp-dkim-02-cds-snc-ca-cname` |
|        | `aws_route53_record.mailchimp-dkim-03-cds-snc-ca-cname` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.mailchimp-dkim-02-cds-snc-ca-cname will be created
  + resource "aws_route53_record" "mailchimp-dkim-02-cds-snc-ca-cname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "k2._domainkey.cds-snc.ca"
      + records         = [
          + "dkim2.mcsv.net",
        ]
      + ttl             = 1800
      + type            = "CNAME"
      + zone_id         = "Z35N8HLYUZDWBH"
    }

  # aws_route53_record.mailchimp-dkim-03-cds-snc-ca-cname will be created
  + resource "aws_route53_record" "mailchimp-dkim-03-cds-snc-ca-cname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "k3._domainkey.cds-snc.ca"
      + records         = [
          + "dkim3.mcsv.net",
        ]
      + ttl             = 1800
      + type            = "CNAME"
      + zone_id         = "Z35N8HLYUZDWBH"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.alpha-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cds-snc-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.platform-canada-ca-public"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
